{
    "instruction cache parity error corrected": 1,
    "MidplaneSwitchController performing bit sparing on R27-M1-L3-U18-C bit 3": 2,
    "generating core.304": 3,
    "generating <*>": 4,
    "1 ddr errors(s) detected and corrected on rank 0, symbol 0, bit 3": 5,
    "3450051 L3 EDRAM error(s) (dcr 0x0157) detected and corrected": 6,
    "CE sym 0, at 0x0b8580c0, mask 0x10": 7,
    "total of 1 ddr error(s) detected and corrected": 8,
    "<*> L3 EDRAM error(s) (dcr 0x0157) detected and corrected": 9,
    "ddr: activating redundant bit steering: rank=0 symbol=0": 10,
    "ddr: excessive soft failures, consider replacing the card": 11,
    "<*> ddr errors(s) detected and corrected on rank 0, symbol 0, bit <*>": 12,
    "<*> ddr errors(s) detected and corrected on rank 0, symbol <*> bit <*>": 13,
    "CE sym <*> at <*> mask <*>": 14,
    "total of <*> ddr error(s) detected and corrected": 15,
    "ciod: Error loading /p/gb2/stella/RAPTOR/65641/raptor: invalid or missing program image, No such file or directory": 16,
    "ciod: Error loading <*> invalid or missing program image, No such file or directory": 17,
    "1347195 double-hummer alignment exceptions": 18,
    "<*> double-hummer alignment exceptions": 19,
    "ddr: activating redundant bit steering: rank=0 <*>": 20,
    "1 tree receiver 2 in re-synch state event(s) (dcr 0x019a) detected": 21,
    "MidplaneSwitchController performing bit sparing on <*> bit 3": 22,
    "idoproxydb has been started: $Name: DRV142_2005 $ Input parameters: -enableflush -loguserinfo db.properties BlueGene1": 23,
    "ciodb has been restarted.": 24,
    "mmcs_db_server has been started: ./mmcs_db_server --useDatabase BGL --dbproperties serverdb.properties --iolog /bgl/BlueLight/logs/BGL --reconnect-blocks all": 25,
    "ciod: LOGIN chdir(/p/gb2/draeger/benchmark/dat32k_060205) failed: No such file or directory": 26,
    "ciod: failed to read message prefix on control stream (CioStream socket to 172.16.96.116:33399": 27,
    "ciod: failed to read message prefix on control stream (CioStream socket to <*>": 28,
    "ciod: LOGIN <*> failed: No such file or directory": 29,
    "<*> L3 <*> error(s) (dcr <*> detected and corrected": 30,
    "data TLB error interrupt": 31,
    "instruction address: 0x0000df30": 32,
    "machine check interrupt": 33,
    "instruction address: <*>": 34,
    "machine check status register: 0x81000000": 35,
    "summary...........................1": 36,
    "instruction plb error.............0": 37,
    "data read plb error...............0": 38,
    "data <*> plb <*>": 39,
    "tlb error.........................0": 40,
    "i-cache parity error..............0": 41,
    "d-cache search parity error.......0": 42,
    "d-cache <*> parity <*>": 43,
    "imprecise machine check...........0": 44,
    "machine state register: 0x0000f000": 45,
    "wait state enable.................0": 46,
    "critical input interrupt enable...0": 47,
    "external input interrupt enable...1": 48,
    "problem state (0=sup,1=usr).......1": 49,
    "floating point instr. enabled.....1": 50,
    "machine check <*>": 51,
    "floating pt ex mode 0 enable......0": 52,
    "debug wait enable.................0": 53,
    "debug interrupt enable............0": 54,
    "floating pt ex mode <*> enable......0": 55,
    "instruction address space.........0": 56,
    "data address space................0": 57,
    "core configuration register: 0x00002000": 58,
    "disable store gathering..................0": 59,
    "disable apu instruction broadcast........0": 60,
    "disable trace broadcast..................0": 61,
    "guaranteed instruction cache block touch.0": 62,
    "guaranteed <*> cache block <*>": 63,
    "force load/store alignment...............0": 64,
    "icache prefetch depth....................0": 65,
    "icache prefetch <*>": 66,
    "general purpose registers:": 67,
    "0:00000000 1:1fefff30 2:1eeeeeee 3:00000000": 68,
    "4:0037f084 5:00460000 6:00000000 7:00000000": 69,
    "8:009f7120 9:00002670 10:009741e0 11:00000000": 70,
    "12:0045fd88 13:1eeeeeee 14:ffffffff 15:ffffffff": 71,
    "16:00000000 17:00000000 18:00000000 19:00000000": 72,
    "20:00000000 21:00000000 22:00000000 23:1fefff40": 73,
    "24:1fefff40 25:0000000a 26:1fefff60 27:009741e0": 74,
    "28:30001460 29:30001510 30:00000000 31:30001400": 75,
    "special purpose registers:": 76,
    "lr:003625f0 cr:20000000 xer:00000002 ctr:0037f084": 77,
    "rts panic! - stopping execution": 78,
    "17 torus receiver x+ input pipe error(s) (dcr 0x02ec) detected and corrected": 79,
    "<*> torus receiver <*> input pipe error(s) (dcr <*> detected and corrected": 80,
    "1 tree receiver <*> in re-synch state event(s) (dcr <*> detected": 81,
    "<*> tree receiver <*> in re-synch state event(s) (dcr <*> detected": 82,
    "data address: 0x4bffffa4": 83,
    "data address: <*>": 84,
    "machine state register: <*>": 85,
    "external input interrupt <*>": 86,
    "problem state <*>": 87,
    "0:00000000 <*> 2:1eeeeeee <*>": 88,
    "4:0000000e 5:000865b0 6:1feaa238 7:0008943c": 89,
    "4:0000000e 5:000865b0 <*> 7:0008943c": 90,
    "4:0000000e 5:000865b0 <*> <*>": 91,
    "8:4bffffa4 9:00000000 10:00090000 11:0000003c": 92,
    "<*> 9:00000000 10:00090000 11:0000003c": 93,
    "<*> 13:1eeeeeee 14:ffffffff 15:ffffffff": 94,
    "16:00000000 17:00000000 <*> <*>": 95,
    "16:00000000 17:00089b10 18:001e7ea0 19:00000001": 96,
    "20:00008000 21:001e7e94 22:1feaa230 23:00000026": 97,
    "20:00008000 21:001e7e94 <*> <*>": 98,
    "24:00000000 25:0000000e 26:000865b0 27:00089ae0": 99,
    "<*> 25:0000000e 26:000865b0 27:00089ae0": 100,
    "28:48000828 29:00000000 30:0000000e 31:000865b0": 101,
    "<*> <*> 30:0000000e 31:000865b0": 102,
    "lr:0000d9ac cr:48000828 xer:00000002 ctr:0000e248": 103,
    "lr:0000d9ac <*> xer:00000002 ctr:0000e248": 104,
    "rts internal error": 105,
    "[MASK]": 106
}